'''Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |'''

number = int(input('Введите трехзначное число: '))
if number//100 != 0 and (number/1000) < 1:
    print(number//100 + number%100//10 + (number%100)%10)
else:
    print("Вы ввели не трёхзначное число")
